korean_names_chars = [
    '가영수', '서윤우', '민수진', '현수진', '현서연', '서지우', '주지윤', '윤시우', '민서아', '아윤서',
    '서지민', '하지윤', '다윤서', '도서연', '시윤우', '윤지율', '수아현', '하서은', '라윤서', '세지윤',
    '가윤서', '현아진', '민주아', '현서진', '서도현', '현서현', '윤서아', '시수진', '시아현', '서아현',
    '라윤아', '도아진', '서시우', '주서은', '지서은', '윤아진', '하수진', '아시윤', '라아현', '가서진',
    '세아현', '라서아', '도윤수', '서아윤', '아시지', '세시아', '라도아', '하윤서', '라서진', '라도윤',
    '다시현', '라수진', '가시아', '하아진', '서시진', '시아수', '라서수', '다윤현', '서아지', '주아서',
    '서시아', '하윤수', '주수진', '세서진', '시아서', '세윤수', '지수진', '윤아수', '하서진', '하아수',
    '세시진', '세서현', '라시진', '다아수', '서서진', '서서수', '하시서', '세아서', '서시수', '지시진',
    '라아진', '주시아', '라서현', '아아진', '주서수', '지아진', '다아현', '세아수', '주서아', '하수수',
    '지서수', '서아수', '하서수', '주아수', '지수수', '다시수', '세시수', '하아서', '주시진', '다수진',
]